{
	"menu": {
		"blog": "Blog",
		"resume": "Resume",
		"portfolio": "Portfolio"
	},
	"resume": {
		"title": "Resume",
		"name": "Jason Han",
		"email": "jasonhan@kakao.com",
		"phone": "437-254-8891",
		"address": "151 Townsgate Dr, Thornhill, ON, Canada",
		"mainTitle": "Hi and welcome!",
		"mainSubTitle": "From Entrepreneurship to Code: My Developer Journey",
		"content1.paragraph1": "I'm a Web Developer with a diverse background in sales, marketing, project management, professional day trading, and over 10 years running my own business.\n\nA few years ago I started learning to code and have focused on JavaScript (ES6+), React, and Styled Components while working full-time as a hardware engineer. That has given me a strong foundation in building engaging designs and interactive features for web applications.\n\nFrom my previous roles I bring transferable skills in communication, problem-solving, and adaptability, and I keep up with new tools and trends to find efficient solutions to complex problems.\n\nI grew up in Canada and am fluent in Korean and English, which helps me work effectively with diverse teams and stakeholders. As a Developer, I'm eager to apply this background to impactful projects and keep growing in web development.\n\nI'm always open to learning and improving, and I use AI-assisted development and other tools to learn efficiently and deliver reliably. I'd be glad to discuss how my experience could support your team. Thank you for considering my profile."
	},
	"skills": {
		"title": "Technical Skills",
		"subtitle1": "HTML, SASS, JavaScript / TypeScript",
		"subtitle2": "Back-end",
		"htmlSassLayout": "Experienced in implementing layouts and responsive web apps with HTML and SASS.",
		"styledComponents": "Use Styled Components to prevent styling bugs even as the app grows.",
		"javascriptEs6": "Experienced in JavaScript ES6+ development.",
		"typescriptExperience": "Experienced in TypeScript.",
		"tailwindCss": "Experienced in utility-first styling with Tailwind CSS."
	},
	"backend": {
		"nodeJs": "Experienced in server-side development with Node.js.",
		"firebase": "Experienced in authentication, database, and hosting with Firebase.",
		"supabase": "Experienced in backend development with Supabase (PostgreSQL, Auth, Realtime).",
		"postgresql": "Experienced in relational database design and queries with PostgreSQL.",
		"restfulApi": "Experienced in designing and consuming RESTful APIs."
	},
	"framework": {
		"title": "Framework & Library",
		"statePropsComponent": "Experienced in designing React components and managing state and props.",
		"spaImplementation": "Experienced in implementing Single Page Applications (SPAs) using React Router.",
		"optimizationExperience": "Experienced in optimizing applications using React.memo, useMemo, and useCallback.",
		"reduxToolkit": "Experienced in state management with Redux Toolkit.",
		"nextJsExperience": "Built server-rendered and static web apps with Next.js.",
		"angularExperience": "Experienced in building web applications with Angular (approx. 2 months)."
	},
	"tools": {
		"title": "Tools"
	},
	"other": {
		"title": "Other",
		"skills": {
			"problemSolving": "Problem Solving",
			"computerSkills": "Computer Skills",
			"leadership": "Leadership",
			"criticalThinking": "Critical Thinking"
		}
	},
	"project1": {
		"title": "Personal Project",
		"subtitle": "Current portfolio site",
		"link": "https://github.com/hiredtocode/sexybrain",
		"linkTitle": "sexybrain github",
		"demoVideoLink": "https://youtu.be/LZf2ztcUjKM",
		"demoVideoLabel": "View demo:",
		"demoVideoLinkText": "Watch demo video",
		"duration": "2022.09 ~ 2022.12",
		"stack": "Stack",
		"description": {
			"listItem1": "I developed this project from scratch without using any templates. The reason for this approach is that when I started developing with React, I wanted to understand how web apps like a blog function. I found that working on small projects and learning the skills hands-on helped me learn more than formal study.",
			"listItem2": "For styling, I initially used CSS, then briefly tried SASS, and later switched to Styled Components. Using Styled Components allows for easier maintenance and eliminates unexpected styling bugs, which is a significant advantage.",
			"listItem3": "Responsive layout for mobile and desktop",
			"listItem4": "Backend uses Firebase for login, posting, editing, and deleting.",
			"listItem5": "Blog posts written in Markdown",
			"listSubItem1": "Login / Logout",
			"listSubItem2": "Post, edit, and delete (after login)",
			"listSubItem3": "Sorted by tags + categories",
			"listItem6": "Portfolio"
		}
	},
	"project2": {
		"title": "Full-Stack Web Application",
		"subtitle": "Torino - Construction Site Management System",
		"link": "https://github.com/hiredtocode/torino",
		"linkTitle": "Torino GitHub",
		"demoVideoLink": "https://youtu.be/-PVJx4KDmO4",
		"demoVideoLabel": "View demo:",
		"demoVideoLinkText": "Watch demo video",
		"duration": "2024.10 ~ 2024.11",
		"stack": "Stack",
		"description": {
			"listItem1": "Developed a full-stack construction site management application using Next.js 16, React 19, and TypeScript. Built comprehensive inventory tracking, work logging, and site management features with real-time updates.",
			"listItem2": "Implemented secure backend with Supabase (PostgreSQL) including Row Level Security policies, database migrations, and RESTful API routes. Integrated Supabase Auth for authentication with OAuth and email/password support.",
			"listItem3": "Built multi-language support (English/Korean) using next-intl with locale-aware routing. Created responsive UI with Tailwind CSS and shadcn/ui components for modern, accessible design.",
			"listItem4": "Developed role-based access control with four user roles (Worker, Manager, Owner, Admin), each with customized dashboards and permissions. Implemented real-time features using Supabase Realtime subscriptions.",
			"listItem5": "Key Features",
			"listSubItem1": "Inventory Management: Check-in/check-out system with real-time tracking",
			"listSubItem2": "Work Logs: Daily logging with approval workflows",
			"listSubItem3": "Site & Floor Management: Multi-floor configuration with drag-and-drop interface",
			"listSubItem4": "Role-Specific Dashboards: Tailored views for each user role",
			"listItem6": "Established comprehensive testing with Jest (unit/component), Playwright (E2E), and database integration tests. Maintained 90%+ coverage and TDD workflow. Deployed using three-environment architecture (Test/Staging/Production) with Vercel."
		}
	},
	"project3": {
		"title": "Desktop App",
		"subtitle": "YouTube Copilot – Educational Video Pre-Production Tool",
		"link": "https://github.com/hiredtocode/youtube_copilot",
		"linkTitle": "YouTube Copilot GitHub",
		"releasesLink": "https://github.com/hiredtocode/youtube_copilot/releases",
		"releasesLinkTitle": "Download app (Windows / macOS / Linux)",
		"demoVideoLink": "https://youtu.be/0-1ENbRKojE",
		"demoVideoLabel": "View demo:",
		"demoVideoLinkText": "Watch demo video",
		"duration": "In progress",
		"stack": "Stack",
		"description": {
			"listItem1": "Educational video pre-production desktop app. Streamlines turning a topic into a structured outline, script, scene plan, and visual assets.",
			"listItem2": "Built with Tauri (Rust) and React + TypeScript + Tailwind CSS. Cross-platform (Windows, macOS, Linux) with local state and filesystem persistence.",
			"listItem3": "Scene-based workflow: segment narration, manage prompts, and track per-scene assets. Integrates with local AI (e.g. LM Studio) for outline and script generation.",
			"listItem4": "Visual tooling: generate images per scene and optional image-to-video generation. Pre-built installers published via GitHub Releases.",
			"listItem5": "Key features",
			"listSubItem1": "End-to-end flow: Topic → outline → script → scenes → visual assets",
			"listSubItem2": "Scene-based workflow with local state and quick access to recents",
			"listSubItem3": "Local AI support (LM Studio); ElevenLabs TTS on macOS/Linux",
			"listSubItem4": "Desktop-first: Tauri app with native filesystem and local persistence",
			"listItem6": "Portfolio piece; many features in progress. Use the \"Download app\" link above for installers. Use the \"View demo\" link for a walkthrough video."
		}
	},
	"portfolio": {
		"description": "In this project, I leveraged React with Styled Components for the frontend, while employing Firebase for seamless login processing and blog posting capabilities on the backend. To efficiently manage the application state, I utilized Redux. Despite the convenience of existing platforms, templates, or frameworks like Bootstrap and Material UI, I opted to design and develop the entire project from scratch to ensure complete control over the process and to enhance my learning experience."
	},
	"categories": {
		"fullStack": "Full Stack Web Application",
		"electron": "Electron App",
		"comingSoon": "Coming soon..."
	}
}
